{
    "save_folder_path_absolute": "/Users/unauthorized/Documents/Combo/02/",
    "weight_map_locations": {
        "repo": "https://huggingface.co/exdysa/metadata/",
        "unet": "transformer/diffusion_pytorch_model.safetensors.index.json",
        "text_encoder": "text_encoder/model.safetensors.index.json",
        "text_encoder_2": "text_encoder_2/model.safetensors.index.json",
        "text_encoder_3": "text_encoder_3/model.safetensors.index.json",
        "image": [
            "nnll_60",
            "ConstructPipeline",
            "create_pipeline"
        ],
        "speech": [],
        "text": [],
        "video": []
    },
    "cogview-3": {
        "local": "/Users/unauthorized/Downloads/models/image_synthesis/CogView3-Plus-3B",
        "repo": "THUDM/CogView3-Plus-3B",
        "defaults": {
            "height": 1024,
            "width": 1024,
            "guidance_scale": 4.0,
            "num_inference_steps": 50
        },
        "torch_dtype": "torch.bfloat16",
        "constructor": "image"
    },
    "kolors": {
        "local": "/Users/unauthorized/Downloads/models/image_synthesis/Kolors-diffusers",
        "repo": "Kwai-Kolors/Kolors-diffusers",
        "defaults": {
            "negative_prompt": "",
            "guidance_scale": 5.0,
            "num_inference_steps": 50
        },
        "pipe_name": "KolorsPipeline",
        "constructor": "image"
    },
    "lumina-2": {
        "local": "/Users/unauthorized/Downloads/models/image_synthesis/Lumina-Image-2.0",
        "repo": "Alpha-VLLM/Lumina-Image-2.0",
        "defaults": {
            "height": 1024,
            "width": 1024,
            "guidance_scale": 4.0,
            "num_inference_steps": 50
        },
        "pipe_name": "Lumina2Text2ImgPipeline",
        "torch_dtype": "torch.bfloat16",
        "constructor": "image"
    },
    "stable-diffusion-1": {},
    "stable-diffusion-xl-base": {
        "local": "/Users/unauthorized/Downloads/models/image_synthesis/stable-diffusion-xl-base-1.0",
        "repo": "stabilityai/stable-diffusion-xl-base-1.0",
        "unet": {
            "weight_map": "weight_maps/stable-diffusion-xl-base.json"
        },
        "sai_modelspec": "/Users/unauthorized/Downloads/models/image/guofeng42fp16.3SbT.safetensors",
        "vae": [
            "/Users/unauthorized/Downloads/models/image_synthesis/sdxl-vae-fp16-fix",
            "/Users/unauthorized/Downloads/models/image/flatpiecexlVAE_baseonA1579.safetensors"
        ],
        "pipe_name": "StableDiffusionXLPipeline",
        "pipe_name_alt": "DiffusionPipeline",
        "pipe_name_i2i": "StableDiffusionXLImg2ImgPipeline",
        "pipe_kwargs": {
            "use_safetensors": true
        },
        "defaults": {
            "num_inference_steps": 40,
            "denoising_end": 0.8,
            "output_type": "latent"
        },
        "config": "/Users/unauthorized/Documents/GitHub/darkshapes/combo/sd_sdxl_base.yaml",
        "constructor": "image"
    },
    "stable-diffusionl-xl-refiner": {
        "local": "/Users/unauthorized/Downloads/models/image_synthesis/stable-diffusion-xl-refiner-1.0",
        "repo": "stabilityai/stable-diffusion-xl-refiner-1.0",
        "unet": {
            "weight_map": "weight_maps/stable-diffusion-xl-refiner.json"
        },
        "pipe_name": "DiffusionPipeline",
        "defaults": {
            "num_inference_steps": 40,
            "denoising_end": 0.8
        },
        "constructor": "image"
    },
    "stable-diffusion-3": {
        "repo": "stabilityai/stable-diffusion-3.5-large",
        "repo_alt": "stabilityai/stable-diffusion-3.5-medium",
        "constructor": "image"
    },
    "flux-1-dev": {
        "repo": "black-forest-labs/FLUX.1-dev",
        "repo_alt": "cocktailpeanut/xulf-d/",
        "constructor": "image"
    },
    "flux-1-schnell": {
        "repo": "black-forest-labs/FLUX.1-schnell",
        "repo_alt": "cocktailpeanut/xulf-s/",
        "unet": {},
        "constructor": "image"
    },
    "pixart-sigma": {
        "local": "/Users/unauthorized/Downloads/models/image_synthesis/PixArt-Sigma-XL-2-1024-MS",
        "repo": "PixArt-alpha/PixArt-Sigma-XL-2-1024-MS",
        "pipe_name": "PixArtSigmaPipeline",
        "constructor": "image"
    },
    "dmd": {
        "solver": "LCMScheduler",
        "solver_kwargs": {},
        "stable-diffusion-xl-base": {
            "local": "/Users/unauthorized/Downloads/models/image_synthesis/lora/dmd/dmd2_sdxl_4step_lora.safetensors",
            "repo": "tianweiy/DMD2/",
            "defaults": {
                "num_inference_steps": 4,
                "guidance_scale": 0,
                "timesteps": [
                    999,
                    749,
                    499,
                    249
                ]
            }
        }
    },
    "dpo": {
        "solver": "DPMSolverMultistepScheduler",
        "solver_kwargs": {
            "algorithm_type": "sde-dpmsolver++",
            "use_karras_sigmas": true,
            "order": 2
        },
        "stable-diffusion-xl-base": {
            "local": "/Users/unauthorized/Downloads/models/image_synthesis/lora/dpo/dpo-sdxl-comfyui.safetensors",
            "repo": "radames/sdxl-DPO-LoRA",
            "defaults": {
                "guidance_scale": 7.5,
                "num_inference_steps": 40
            }
        }
    },
    "flash": {
        "solver": "lcm",
        "solver_kwargs": {},
        "stable-diffusion-xl-base": {
            "repo": "jasperai/flash-sdxl"
        },
        "pixart-alpha": {
            "repo": "jasperai/flash-pixart"
        },
        "stable-diffusion-3": {
            "repo": "jasperai/flash-sd3"
        },
        "stable-diffusion-1": {
            "local": "/Users/unauthorized/Downloads/models/image_synthesis/lora/flash/flash-sd.safetensors",
            "repo": "jasperai/flash-sd",
            "defaults": {
                "num_inference_steps": 4,
                "guidance_scale": 0
            }
        }
    },
    "hyper": {
        "stable-diffusion-xl-base": {
            "repo": "ByteDance/Hyper-SD",
            "fuse": 1.0
        },
        "flux-1-dev": {
            "local": "/Users/unauthorized/Downloads/models/image_synthesis/lora/hyper/Hyper-FLUX.1-dev-16steps-lora.safetensors",
            "repo": "ByteDance/Hyper-SD",
            "fuse": 0.125
        },
        "stable-diffusion-3": {
            "repo": "ByteDance/Hyper-SD",
            "fuse": 0.125
        },
        "stable-diffusion-1": {
            "repo": "ByteDance/Hyper-SD"
        }
    },
    "lcm": {
        "defaults": {
            "num_inference_steps": 8
        },
        "solver": "LCMScheduler",
        "solver_kwargs": {
            "timestep_spacing": "trailing"
        },
        "stable-diffusion-xl-base": {
            "local": "/Users/unauthorized/Downloads/models/image_synthesis/lora/lcm/lcm.safetensors",
            "repo": "latent-consistency/lcm-lora-sdxl",
            "fuse": 1.0
        },
        "ssd-1b": {
            "repo": "latent-consistency/lcm-lora-ssd-1b"
        },
        "vega": {
            "repo": "segmind/Segmind-VegaRT"
        },
        "stable-diffusion-1": {
            "repo": "latent-consistency/lcm-lora-sdv1-5"
        }
    },
    "lightning": {
        "stable-diffusion-xl-base": {
            "local": "/Users/unauthorized/Downloads/models/image_synthesis/lora/lightning/sdxl_lightning_4step_lora.safetensors",
            "repo": "ByteDance/SDXL-Lightning",
            "defaults": {
                "num_inference_steps": 4,
                "guidance_scale": 0
            }
        }
    },
    "pcm": {
        "stable-diffusion-xl-base": {
            "repo": "wangfuyun/PCM_Weights"
        },
        "stable-diffusion-1": {
            "repo": "wangfuyun/PCM_Weights"
        }
    },
    "slam": {
        "solver": "LCMScheduler",
        "solver_kwargs": {
            "timestep_spacing": "trailing"
        },
        "stable-diffusion-xl-base": {
            "local": "/Users/unauthorized/Downloads/models/image_synthesis/lora/slam/slam-lora-sdxl.safetensors",
            "repo": "alimama-creative/slam-lora-sdxl/",
            "defaults": {
                "num_inference_steps": 4,
                "guidance_scale": 1
            }
        },
        "stable-diffusion-1": {
            "repo": "alimama-creative/slam-sd1.5"
        }
    },
    "spo": {
        "stable-diffusion-xl-base": {
            "local": "/Users/unauthorized/Downloads/models/image_synthesis/lora/spo/spo_sdxl_10ep_4k-data_lora_diffusers.safetensors",
            "repo": "SPO-Diffusion-Models/SPO-SDXL_4k-p_10ep_LoRA",
            "defaults": {
                "guidance_scale": 5.0
            }
        },
        "stable-diffusion-1": {
            "local": "/Users/unauthorized/Downloads/models/image_synthesis/lora/spo/spo-sd-v1-5_4k-p_10ep_lora_diffusers.safetensors",
            "repo": "SPO-Diffusion-Models/SPO-SD-v1-5_4k-p_10ep_LoRA",
            "defaults": {
                "guidance_scale": 7.5
            }
        }
    },
    "tcd": {
        "solver": "TCDScheduler",
        "solver_kwargs": {},
        "stable-diffusion-xl-base": {
            "local": "/Users/unauthorized/Downloads/models/image_synthesis/lora/tcd/tcd-sdxl.safetensors",
            "repo": "h1t/TCD-SDXL-LoRA",
            "defaults": {
                "num_inference_steps": 4,
                "guidance_scale": 0,
                "eta": 0.3
            }
        },
        "stable-diffusion-1": {
            "repo": "h1t/TCD-SD15-LoRA"
        }
    },
    "turbo": {
        "flux-1-dev": {
            "local": "/Users/unauthorized/Downloads/models/image_synthesis/lora/turbo/flux1_turbo_alpha_lora.safetensors",
            "repo": "alimama-creative/FLUX.1-Turbo-Alpha",
            "defaults": {
                "guidance_scale": 3.5,
                "num_inference_steps": 8,
                "max_sequence_length": 512
            },
            "fuse": 0.125
        }
    }
}