{
    "model.unet.kolors": {
        "name": {
            "base": {
                "repo": "Kwai-Kolors/Kolors-diffusers",
                "gen_kwargs": {
                    "negative_prompt": "",
                    "guidance_scale": 5.0,
                    "num_inference_steps": 50
                },
                "pipe_kwargs": {
                    "torch_dtype": "torch.float16",
                    "variant": "fp16"
                },
                "pipe_name": "KolorsPipeline",
                "constructor": "image"
            }
        }
    },
    "model.unet.stable-cascade": {
        "name": {
            "c": {
                "layer_256": [
                    "2b6986954d9d2b0c702911504f78f5021843bd7050bb10444d70fa915cb495ea",
                    "2aa5a461c4cd0e2079e81554081854a2fa01f9b876d7124c8fff9bf1308b9df7",
                    "ce474fd5da12f1d465a9d236d61ea7e98458c1b9d58d35bb8412b2acb9594f08",
                    "1b035ba92da6bec0a9542219d12376c0164f214f222955024c884e1ab08ec611",
                    "22a49dc9d213d5caf712fbf755f30328bc2f4cbdc322bcef26dfcee82f02f147"
                ]
            },
            "b": {
                "layer_256": [
                    "fde5a91a908e8cb969f97bcd20e852fb028cc039a19633b0e1559ae41edeb16f",
                    "24fa8b55d12bf904878b7f2cda47c04c1a92da702fe149e28341686c080dfd4f",
                    "a7c96afb54e60386b7d077bf3f00d04596f4b877d58e6a577f0e1a08dc4a0190",
                    "f1300b9ffe051640555bfeee245813e440076ef90b669332a7f9fb35fffb93e8",
                    "047fa405c9cd5ad054d8f8c8baa2294fbc663e4121828b22cb190f7057842a64"
                ]
            }
        }
    },
    "model.unet.stable-diffusion-xl": {
        "name": {
            "base": {
                "repo": "stabilityai/stable-diffusion-xl-base-1.0",
                "layer_256": [
                    "62a5ab1b5fdfa4fedb32323841298c6effe1af25be94a8583350b0a7641503ef"
                ],
                "unet": {
                    "weight_map": "weight_maps/model.unet.stable-diffusion-xl:base.json"
                },
                "pipe_name": "StableDiffusionXLPipeline",
                "pipe_name_alt": "DiffusionPipeline",
                "pipe_name_i2i": "StableDiffusionXLImg2ImgPipeline",
                "pipe_kwargs": {
                    "use_safetensors": true
                },
                "gen_kwargs": {
                    "num_inference_steps": 40,
                    "denoising_end": 0.8,
                    "output_type": "latent",
                    "safety_checker": false
                },
                "constructor": "image"
            },
            "refiner": {
                "repo": "stabilityai/stable-diffusion-xl-refiner-1.0",
                "layer_256": [
                    "8c2d0d32cff5a74786480bbaa932ee504bb140f97efdd1a3815f14a610cf6e4a"
                ],
                "unet": {
                    "weight_map": "weight_maps/stable-diffusion-xl-refiner.json"
                },
                "pipe_name": "DiffusionPipeline",
                "gen_kwargs": {
                    "num_inference_steps": 40,
                    "denoising_end": 0.8
                },
                "constructor": "image"
            },
            "pony_diffusion": {
                "layer_256": [
                    "d4fc7682a4ea9f2dfa0133fafb068f03fdb479158a58260dcaa24dcf33608c16"
                ]
            },
            "animagine": {
                "layer_256": [
                    "31164c11db41b007f15c94651a8b1fa4d24097c18782d20fabe13c59ee07aa3a"
                ]
            },
            "illustrious": {
                "layer_256": [
                    "c4a8d365e7fe07c6dbdd52be922aa6dc23215142342e3e7f8f967f1a123a6982"
                ]
            },
            "turbo": {
                "layer_256": [
                    "fc94481f0c52b21c5ac1fdade8d9c5b210f7239253f86ef21e6198fe393ed60e"
                ]
            },
            "playground-2.5-base": {
                "layer_256": [
                    "a6f31493ceeb51c88c5239188b9078dc64ba66d3fc5958ad48c119115b06120c"
                ]
            },
            "playground-2.5-aesthetic": {
                "repo": "playgroundai/playground-v2.5-1024px-aesthetic",
                "layer_256": [
                    "fe2e9edf7e3923a80e64c2552139d8bae926cc3b028ca4773573a6ba60e67c20",
                    "d4813e9f984aa76cb4ac9bf0972d55442923292d276e97e95cb2f49a57227843"
                ],
                "pipe_name": "DiffusionPipeline",
                "pipe_kwargs": {
                    "torch_dtype": "torch.float16",
                    "variant": "fp16"
                },
                "gen_kwargs": {
                    "num_inference_steps": 50,
                    "guidance_scale": 3
                },
                "constructor": "image"
            }
        }
    },
    "model.dit.stable-diffusion-3": {
        "name": {
            "medium": {
                "repo": "stabilityai/stable-diffusion-3.5-medium",
                "layer_256": [
                    "dee29a467c44cff413fcf1c2dda0b31f5f0a4e093029a8e5a05140f40ae061ee"
                ],
                "repo_alt": [
                    "adamo1139/stable-diffusion-3.5-medium-ungated"
                ],
                "pipe_name": "StableDiffusion3Pipeline",
                "gen_kwargs": {
                    "num_inference_steps": 40,
                    "guidance_scale": 4.5
                },
                "pipe_kwargs": {
                    "torch_dtype": "torch.float16"
                },
                "constructor": "image"
            },
            "large": {
                "repo": "stabilityai/stable-diffusion-3.5-large",
                "layer_256": [
                    "8c2e5bc99bc89290254142469411db66cb2ca2b89b129cd2f6982b30e26bd465"
                ],
                "repo_alt": [
                    "adamo1139/stable-diffusion-3.5-large-ungated"
                ],
                "pipe_name": "StableDiffusion3Pipeline",
                "gen_kwargs": {
                    "num_inference_steps": 28,
                    "guidance_scale": 3.5
                },
                "pipe_kwargs": {
                    "torch_dtype": "torch.float16"
                },
                "constructor": "image"
            },
            "gguf": {
                "layer_256": [
                    "e7eddc3cd09ccf7c9c03ceef70bbcd91d44d46673857d37c3abfe4e6ee240a96"
                ]
            },
            "alchemist-large": {
                "repo": "yandex/stable-diffusion-3.5-large-alchemist",
                "pipe_name": "StableDiffusion3Pipeline",
                "gen_kwargs": {
                    "num_inference_steps": 28,
                    "guidance_scale": 3.5
                },
                "pipe_kwargs": {
                    "torch_dtype": "torch.bfloat16"
                },
                "constructor": "image"
            },
            "alchemist-medium": {
                "repo": "yandex/stable-diffusion-3.5-medium-alchemist",
                "pipe_name": "StableDiffusion3Pipeline",
                "gen_kwargs": {
                    "num_inference_steps": 40,
                    "guidance_scale": 4.5
                },
                "pipe_kwargs": {
                    "torch_dtype": "torch.bfloat16"
                },
                "constructor": "image"
            }
        }
    },
    "model.dit.flux-1": {
        "name": {
            "schnell": {
                "repo": "black-forest-labs/flux.1-schnell",
                "layer_256": [
                    "ef5c9cd1ebe6e3be5e8b1347eca0a6f0b138986c71220a7f1c2c14f29d01beed"
                ],
                "pipe_name": "FluxPipeline",
                "repo_alt": [
                    "cocktailpeanut/xulf-s"
                ],
                "unet": {},
                "gen_kwargs": {
                    "guidance_scale": 0.0,
                    "num_inference_steps": 4,
                    "max_sequence_length": 256
                },
                "pipe_kwargs": {
                    "torch_dtype": "torch.bfloat16"
                },
                "constructor": "image"
            },
            "shuttle-3.1-aesthetic": {
                "repo": "shuttleai/shuttle-3.1-aesthetic",
                "pipe_name": "DiffusionPipeline",
                "pipe_kwargs": {
                    "torch_dtype": "torch.bfloat16"
                },
                "gen_kwargs": {
                    "height": 1024,
                    "width": 1024,
                    "guidance_scale": 3.5,
                    "num_inference_steps": 4,
                    "max_sequence_length": 256
                },
                "constructor": "image"
            },
            "shuttle-3": {
                "repo": "shuttleai/shuttle-3-diffusion",
                "pipe_name": "DiffusionPipeline",
                "pipe_kwargs": {
                    "torch_dtype": "torch.bfloat16"
                },
                "gen_kwargs": {
                    "height": 1024,
                    "width": 1024,
                    "guidance_scale": 3.5,
                    "num_inference_steps": 4,
                    "max_sequence_length": 256
                },
                "constructor": "image"
            },
            "dev": {
                "repo": "black-forest-labs/flux.1-dev",
                "layer_256": [
                    "ad8763121f98e28bc4a3d5a8b494c1e8f385f14abe92fc0ca5e4ab3191f3a881",
                    "20d47474da0714979e543b6f21bd12be5b5f721119c4277f364a29e329e931b9"
                ],
                "repo_alt": [
                    "cocktailpeanut/xulf-d"
                ],
                "pipe_name": "FluxPipeline",
                "gen_kwargs": {
                    "height": 1024,
                    "width": 1024,
                    "guidance_scale": 3.5,
                    "num_inference_steps": 50,
                    "max_sequence_length": 512
                },
                "pipe_kwargs": {
                    "torch_dtype": "torch.bfloat16"
                },
                "constructor": "image"
            },
            "lite": {
                "repo": "Freepik/flux.1-lite-8B",
                "repo_alt": [
                    "Freepik/F-Lite-Texture"
                ],
                "pipe_name": "FluxPipeline",
                "gen_kwargs": {
                    "num_inference_steps": 28,
                    "guidance_scale": 3.5,
                    "height": 1024,
                    "width": 1024
                },
                "pipe_kwargs": {
                    "torch_dtype": "torch.bfloat16"
                },
                "constructor": "image"
            },
            "hybrid": {
                "layer_256": [
                    "14d0e1b573023deb5a4feaddf85ebca10ab2abf3452c433e2e3ae93acb216443",
                    "14d0e1b573023deb5a4feaddf85ebca10ab2abf3452c433e2e3ae93acb216443"
                ]
            },
            "mini": {
                "layer_256": [
                    "e4a0d8cf2034da094518ab058da1d4aea14e00d132c6152a266ec196ffef02d0"
                ]
            }
        }
    },
    "model.dit.auraflow": {
        "name": {
            "base": {
                "repo": "fal/AuraFlow-v0.3",
                "repo_alt": [
                    "fal/AuraFlow-v0.2",
                    "fal/AuraFlow"
                ],
                "pipe_name": "AuraFlowPipeline",
                "gen_kwargs": {
                    "width": 1536,
                    "height": 768,
                    "num_inference_steps": 50,
                    "guidance_scale": 3.5
                },
                "constructor": "image"
            }
        }
    },
    "model.dit.hunyuandit": {
        "name": {
            "base": {
                "repo": "Tencent-Hunyuan/HunyuanDiT-v1.2-Diffusers",
                "pipe_name": "HunyuanDiTPipeline",
                "pipe_kwargs": {
                    "num_inference_steps": 50,
                    "guidance_scale": 6
                },
                "constructor": "image"
            },
            "distilled": {
                "repo": "Tencent-Hunyuan/HunyuanDiT-v1.2-Diffusers-Distilled",
                "pipe_name": "HunyuanDiTPipeline",
                "pipe_kwargs": {
                    "num_inference_steps": 25
                },
                "constructor": "image"
            }
        }
    },
    "model.dit.pixart-sigma": {
        "name": {
            "base": {
                "repo": "PixArt-alpha/PixArt-Sigma-XL-2-1024-MS",
                "pipe_name": "PixArtSigmaPipeline",
                "pipe_kwargs": {
                    "torch_dtype": "torch.float16",
                    "use_safetensors": true
                },
                "constructor": "image"
            }
        }
    },
    "model.dit.cogview-3": {
        "name": {
            "base": {
                "repo": "THUDM/CogView3-Plus-3B",
                "gen_kwargs": {
                    "height": 1024,
                    "width": 1024,
                    "guidance_scale": 4.0,
                    "num_inference_steps": 50
                },
                "pipe_name": "CogView3PlusPipeline",
                "pipe_kwargs": {
                    "torch_dtype": "torch.bfloat16"
                },
                "constructor": "image"
            }
        }
    },
    "model.dit.cogview-4": {
        "name": {
            "base": {
                "repo": "THUDM/CogView4-6B",
                "gen_kwargs": {
                    "height": 1024,
                    "width": 1024,
                    "guidance_scale": 3.5,
                    "num_images_per_prompt": 1,
                    "num_inference_steps": 50
                },
                "pipe_name": "CogView4Pipeline",
                "pipe_kwargs": {
                    "torch_dtype": "torch.bfloat16"
                },
                "constructor": "image"
            }
        }
    },
    "model.dit.lumina-2": {
        "name": {
            "base": {
                "repo": "Alpha-VLLM/Lumina-Image-2.0",
                "gen_kwargs": {
                    "height": 1024,
                    "width": 1024,
                    "guidance_scale": 4.0,
                    "num_inference_steps": 50,
                    "cfg_trunc_ratio": 0.25,
                    "cfg_normalization": true
                },
                "pipe_name": "Lumina2Pipeline",
                "pipe_kwargs": {
                    "torch_dtype": "torch.bfloat16"
                },
                "constructor": "image"
            }
        }
    },
    "model.art.phi-4": {
        "name": {
            "base": {
                "repo": "microsoft/Phi-4-multimodal-instruct",
                "pipe_name": "AutoModelForCausalLM",
                "pipe_kwargs": {
                    "torch_dtype": "torch.bfloat16"
                },
                "constructor": "text"
            }
        }
    },
    "model.art.lumina-mgpt": {
        "name": {
            "base": {
                "repo": "Alpha-VLLM/Lumina-mGPT-7B-768",
                "pipe_name": "FlexARInferenceSolver",
                "pipe_kwargs": {
                    "model_path": "Alpha-VLLM/Lumina-mGPT-7B-768",
                    "precision": "bf16",
                    "target_size": 768
                },
                "gen_kwargs": {
                    "images": [],
                    "qas": [
                        [
                            "q1",
                            null
                        ]
                    ],
                    "max_gen_len": 8192,
                    "temperature": 1.0
                }
            }
        }
    },
    "model.lora.dmd": {
        "name": {
            "stable-diffusion-xl": {
                "repo": "tianweiy/DMD2/",
                "solver": "LCMScheduler",
                "solver_kwargs": {},
                "gen_kwargs": {
                    "num_inference_steps": 4,
                    "guidance_scale": 0,
                    "timesteps": [
                        999,
                        749,
                        499,
                        249
                    ]
                }
            }
        }
    },
    "model.lora.dpo": {
        "name": {
            "stable-diffusion-xl:base": {
                "repo": "radames/sdxl-DPO-LoRA",
                "solver": "DPMSolverMultistepScheduler",
                "solver_kwargs": {
                    "algorithm_type": "sde-dpmsolver++",
                    "use_karras_sigmas": true,
                    "order": 2
                },
                "gen_kwargs": {
                    "guidance_scale": 7.5,
                    "num_inference_steps": 40
                }
            }
        },
        "model.lora.flash": {
            "name": {
                "stable-diffusion-xl:base": {
                    "repo": "jasperai/flash-sdxl",
                    "solver": "lcm",
                    "solver_kwargs": {}
                },
                "pixart-alpha": {
                    "repo": "jasperai/flash-pixart",
                    "solver": "lcm",
                    "solver_kwargs": {}
                },
                "stable-diffusion-3": {
                    "repo": "jasperai/flash-sd3",
                    "solver": "lcm",
                    "solver_kwargs": {}
                },
                "stable-diffusion-1": {
                    "repo": "jasperai/flash-sd",
                    "gen_kwargs": {
                        "num_inference_steps": 4,
                        "guidance_scale": 0
                    },
                    "solver": "lcm",
                    "solver_kwargs": {}
                }
            }
        },
        "model.lora.hyper": {
            "name": {
                "stable-diffusion-xl:base": {
                    "repo": "ByteDance/Hyper-SD",
                    "lora_kwargs": {
                        "fuse": 1.0
                    }
                },
                "flux-1:dev": {
                    "repo": "ByteDance/Hyper-SD",
                    "lora_kwargs": {
                        "fuse": 0.125
                    }
                },
                "stable-diffusion-3": {
                    "repo": "ByteDance/Hyper-SD",
                    "lora_kwargs": {
                        "fuse": 0.125
                    }
                },
                "stable-diffusion-1": {
                    "repo": "ByteDance/Hyper-SD"
                }
            }
        },
        "model.lora.lcm": {
            "name": {
                "stable-diffusion-xl:base": {
                    "repo": "latent-consistency/lcm-lora-sdxl",
                    "lora_kwargs": {
                        "fuse": 1.0
                    },
                    "gen_kwargs": {
                        "num_inference_steps": 8
                    },
                    "solver": "LCMScheduler",
                    "solver_kwargs": {
                        "timestep_spacing": "trailing"
                    }
                },
                "ssd-1b": {
                    "repo": "latent-consistency/lcm-lora-ssd-1b",
                    "gen_kwargs": {
                        "num_inference_steps": 8
                    },
                    "solver": "LCMScheduler",
                    "solver_kwargs": {
                        "timestep_spacing": "trailing"
                    }
                },
                "vega": {
                    "repo": "segmind/Segmind-VegaRT",
                    "gen_kwargs": {
                        "num_inference_steps": 8
                    },
                    "solver": "LCMScheduler",
                    "solver_kwargs": {
                        "timestep_spacing": "trailing"
                    }
                },
                "stable-diffusion-1": {
                    "repo": "latent-consistency/lcm-lora-sdv1-5",
                    "gen_kwargs": {
                        "num_inference_steps": 8
                    },
                    "solver": "LCMScheduler",
                    "solver_kwargs": {
                        "timestep_spacing": "trailing"
                    }
                }
            }
        },
        "model.lora.lightning": {
            "name": {
                "stable-diffusion-xl:base": {
                    "repo": "ByteDance/SDXL-Lightning",
                    "gen_kwargs": {
                        "num_inference_steps": 4,
                        "guidance_scale": 0
                    }
                }
            }
        },
        "model.lora.pcm": {
            "name": {
                "stable-diffusion-xl:base": {
                    "repo": "wangfuyun/PCM_Weights"
                },
                "stable-diffusion-1": {
                    "repo": "wangfuyun/PCM_Weights"
                }
            }
        },
        "info.lora.slam": {
            "name": {
                "stable-diffusion-xl:base": {
                    "repo": "alimama-creative/slam-lora-sdxl/",
                    "gen_kwargs": {
                        "num_inference_steps": 4,
                        "guidance_scale": 1
                    },
                    "solver": "LCMScheduler",
                    "solver_kwargs": {
                        "timestep_spacing": "trailing"
                    }
                },
                "stable-diffusion-1": {
                    "repo": "alimama-creative/slam-sd1.5",
                    "solver": "LCMScheduler",
                    "solver_kwargs": {
                        "timestep_spacing": "trailing"
                    }
                }
            }
        },
        "model.lora.spo": {
            "name": {
                "stable-diffusion-xl:base": {
                    "repo": "SPO-Diffusion-Models/SPO-SDXL_4k-p_10ep_LoRA",
                    "gen_kwargs": {
                        "guidance_scale": 5.0
                    }
                },
                "stable-diffusion-1": {
                    "repo": "SPO-Diffusion-Models/SPO-SD-v1-5_4k-p_10ep_LoRA",
                    "gen_kwargs": {
                        "guidance_scale": 7.5
                    }
                }
            }
        },
        "model.lora.tcd": {
            "name": {
                "stable-diffusion-xl:base": {
                    "repo": "h1t/TCD-SDXL-LoRA",
                    "gen_kwargs": {
                        "num_inference_steps": 4,
                        "guidance_scale": 0,
                        "eta": 0.3
                    },
                    "solver": "TCDScheduler",
                    "solver_kwargs": {}
                },
                "stable-diffusion-1": {
                    "repo": "h1t/TCD-SD15-LoRA",
                    "solver": "TCDScheduler",
                    "solver_kwargs": {}
                }
            }
        },
        "model.lora.turbo": {
            "name": {
                "flux-1:dev": {
                    "repo": "alimama-creative/FLUX.1-Turbo-Alpha",
                    "gen_kwargs": {
                        "guidance_scale": 3.5,
                        "num_inference_steps": 8,
                        "max_sequence_length": 512
                    },
                    "lora_kwargs": {
                        "fuse": 0.125
                    }
                }
            }
        }
    }
}