{
    "model.dit.cogview-3": {
        "repo": "THUDM/CogView3-Plus-3B",
        "defaults": {
            "height": 1024,
            "width": 1024,
            "guidance_scale": 4.0,
            "num_inference_steps": 50
        },
        "pipe_name": "CogView3PlusPipeline",
        "pipe_kwargs": {
            "torch_dtype": "torch.bfloat16"
        },
        "constructor": "image"
    },
    "model.dit.cogview-4": {
        "repo": "THUDM/CogView4-6B",
        "defaults": {
            "height": 1024,
            "width": 1024,
            "guidance_scale": 3.5,
            "num_images_per_prompt": 1,
            "num_inference_steps": 50
        },
        "pipe_name": "CogView4Pipeline",
        "torch_dtype": "torch.bfloat16",
        "constructor": "image"
    },
    "model.unet.kolors": {
        "repo": "Kwai-Kolors/Kolors-diffusers",
        "defaults": {
            "negative_prompt": "",
            "guidance_scale": 5.0,
            "num_inference_steps": 50
        },
        "pipe_name": "KolorsPipeline",
        "constructor": "image"
    },
    "model.dit.lumina-2": {
        "repo": "Alpha-VLLM/Lumina-Image-2.0",
        "defaults": {
            "height": 1024,
            "width": 1024,
            "guidance_scale": 4.0,
            "num_inference_steps": 50
        },
        "pipe_name": "Lumina2Text2ImgPipeline",
        "torch_dtype": "torch.bfloat16",
        "constructor": "image"
    },
    "model.unet.stable-diffusion-xl:base": {
        "repo": "stabilityai/stable-diffusion-xl-base-1.0",
        "unet": {
            "weight_map": "weight_maps/model.unet.stable-diffusion-xl:base.json"
        },
        "pipe_name": "StableDiffusionXLPipeline",
        "pipe_name_alt": "DiffusionPipeline",
        "pipe_name_i2i": "StableDiffusionXLImg2ImgPipeline",
        "pipe_kwargs": {
            "use_safetensors": true
        },
        "defaults": {
            "num_inference_steps": 40,
            "denoising_end": 0.8,
            "output_type": "latent",
            "safety_checker": false
        },
        "constructor": "image"
    },
    "model.unet.stable-diffusionl-xl:refiner": {
        "repo": "stabilityai/stable-diffusion-xl-refiner-1.0",
        "unet": {
            "weight_map": "weight_maps/stable-diffusion-xl-refiner.json"
        },
        "pipe_name": "DiffusionPipeline",
        "defaults": {
            "num_inference_steps": 40,
            "denoising_end": 0.8
        },
        "constructor": "image"
    },
    "model.dit.stable-diffusion-3:medium": {
        "repo": "stabilityai/stable-diffusion-3.5-medium",
        "repo_alt": "https://huggingface.co/adamo1139/stable-diffusion-3.5-medium-ungated",
        "pipe_name": "StableDiffusion3Pipeline",
        "defaults": {
            "num_inference_steps": 40,
            "guidance_scale": 4.5
        },
        "constructor": "image"
    },
    "model.dit.stable-diffusion-3:large": {
        "repo": "stabilityai/stable-diffusion-3.5-large",
        "repo_alt": "https://huggingface.co/adamo1139/stable-diffusion-3.5-large-ungated",
        "pipe_name": "StableDiffusion3Pipeline",
        "defaults": {
            "num_inference_steps": 28,
            "guidance_scale": 3.5
        },
        "constructor": "image"
    },
    "model.dit.stable-diffusion-3:alchemist-large": {
        "repo": "yandex/stable-diffusion-3.5-large-alchemist",
        "pipe_name": "StableDiffusion3Pipeline",
        "defaults": {
            "num_inference_steps": 28,
            "guidance_scale": 3.5
        },
        "constructor": "image"
    },
    "model.dit.stable-diffusion-3:alchemist-medium": {
        "repo": "yandex/stable-diffusion-3.5-medium-alchemist",
        "pipe_name": "StableDiffusion3Pipeline",
        "defaults": {
            "num_inference_steps": 40,
            "guidance_scale": 4.5
        },
        "constructor": "image"
    },
    "model.dit.flux-1:dev": {
        "repo": "black-forest-labs/FLUX.1-dev",
        "repo_alt": "cocktailpeanut/xulf-d/",
        "pipe_name": "FluxPipeline",
        "constructor": "image"
    },
    "model.dit.flux-1:schnell": {
        "repo": "black-forest-labs/FLUX.1-schnell",
        "pipe_name": "FluxPipeline",
        "repo_alt": "cocktailpeanut/xulf-s/",
        "unet": {},
        "constructor": "image"
    },
    "model.dit.flux-1:lite": {
        "repo": "Freepik/flux.1-lite-8B",
        "repo_alt": "Freepik/F-Lite-Texture",
        "pipe_name": "FluxPipeline",
        "defaults": {
            "num_inference_steps": 28,
            "guidance_scale": 3.5,
            "height": 1024,
            "width": 1024
        },
        "torch_dtype": "torch.bfloat16",
        "constructor": "image"
    },
    "model.dit.pixart-sigma": {
        "repo": "PixArt-alpha/PixArt-Sigma-XL-2-1024-MS",
        "pipe_name": "PixArtSigmaPipeline",
        "constructor": "image"
    },
    "model.lora.dmd": {
        "solver": "LCMScheduler",
        "solver_kwargs": {},
        "stable-diffusion-xl:base": {
            "repo": "tianweiy/DMD2/",
            "defaults": {
                "num_inference_steps": 4,
                "guidance_scale": 0,
                "timesteps": [
                    999,
                    749,
                    499,
                    249
                ]
            }
        }
    },
    "model.lora.dpo": {
        "solver": "DPMSolverMultistepScheduler",
        "solver_kwargs": {
            "algorithm_type": "sde-dpmsolver++",
            "use_karras_sigmas": true,
            "order": 2
        },
        "stable-diffusion-xl:base": {
            "repo": "radames/sdxl-DPO-LoRA",
            "defaults": {
                "guidance_scale": 7.5,
                "num_inference_steps": 40
            }
        }
    },
    "model.lora.flash": {
        "solver": "lcm",
        "solver_kwargs": {},
        "stable-diffusion-xl:base": {
            "repo": "jasperai/flash-sdxl"
        },
        "pixart-alpha": {
            "repo": "jasperai/flash-pixart"
        },
        "stable-diffusion-3": {
            "repo": "jasperai/flash-sd3"
        },
        "stable-diffusion-1": {
            "repo": "jasperai/flash-sd",
            "defaults": {
                "num_inference_steps": 4,
                "guidance_scale": 0
            }
        }
    },
    "model.lora.hyper": {
        "stable-diffusion-xl:base": {
            "repo": "ByteDance/Hyper-SD",
            "fuse": 1.0
        },
        "flux-1:dev": {
            "repo": "ByteDance/Hyper-SD",
            "fuse": 0.125
        },
        "stable-diffusion-3": {
            "repo": "ByteDance/Hyper-SD",
            "fuse": 0.125
        },
        "stable-diffusion-1": {
            "repo": "ByteDance/Hyper-SD"
        }
    },
    "model.lora.lcm": {
        "defaults": {
            "num_inference_steps": 8
        },
        "solver": "LCMScheduler",
        "solver_kwargs": {
            "timestep_spacing": "trailing"
        },
        "stable-diffusion-xl:base": {
            "repo": "latent-consistency/lcm-lora-sdxl",
            "fuse": 1.0
        },
        "ssd-1b": {
            "repo": "latent-consistency/lcm-lora-ssd-1b"
        },
        "vega": {
            "repo": "segmind/Segmind-VegaRT"
        },
        "stable-diffusion-1": {
            "repo": "latent-consistency/lcm-lora-sdv1-5"
        }
    },
    "model.lora.lightning": {
        "stable-diffusion-xl:base": {
            "repo": "ByteDance/SDXL-Lightning",
            "defaults": {
                "num_inference_steps": 4,
                "guidance_scale": 0
            }
        }
    },
    "model.lora.pcm": {
        "stable-diffusion-xl:base": {
            "repo": "wangfuyun/PCM_Weights"
        },
        "stable-diffusion-1": {
            "repo": "wangfuyun/PCM_Weights"
        }
    },
    "model.lora.slam": {
        "solver": "LCMScheduler",
        "solver_kwargs": {
            "timestep_spacing": "trailing"
        },
        "stable-diffusion-xl:base": {
            "repo": "alimama-creative/slam-lora-sdxl/",
            "defaults": {
                "num_inference_steps": 4,
                "guidance_scale": 1
            }
        },
        "stable-diffusion-1": {
            "repo": "alimama-creative/slam-sd1.5"
        }
    },
    "model.lora.spo": {
        "stable-diffusion-xl:base": {
            "repo": "SPO-Diffusion-Models/SPO-SDXL_4k-p_10ep_LoRA",
            "defaults": {
                "guidance_scale": 5.0
            }
        },
        "stable-diffusion-1": {
            "repo": "SPO-Diffusion-Models/SPO-SD-v1-5_4k-p_10ep_LoRA",
            "defaults": {
                "guidance_scale": 7.5
            }
        }
    },
    "model.lora.tcd": {
        "solver": "TCDScheduler",
        "solver_kwargs": {},
        "stable-diffusion-xl:base": {
            "repo": "h1t/TCD-SDXL-LoRA",
            "defaults": {
                "num_inference_steps": 4,
                "guidance_scale": 0,
                "eta": 0.3
            }
        },
        "stable-diffusion-1": {
            "repo": "h1t/TCD-SD15-LoRA"
        }
    },
    "model.lora.turbo": {
        "flux-1:dev": {
            "repo": "alimama-creative/FLUX.1-Turbo-Alpha",
            "defaults": {
                "guidance_scale": 3.5,
                "num_inference_steps": 8,
                "max_sequence_length": 512
            },
            "fuse": 0.125
        }
    },
    "weight_map_locations": {
        "repo": "https://huggingface.co/exdysa/mir/",
        "unet": "transformer/diffusion_pytorch_model.safetensors.index.json",
        "text_encoder": "text_encoder/model.safetensors.index.json",
        "text_encoder_2": "text_encoder_2/model.safetensors.index.json",
        "text_encoder_3": "text_encoder_3/model.safetensors.index.json",
        "image": [
            "nnll_60",
            "ConstructPipeline",
            "create_pipeline"
        ],
        "speech": [],
        "text": [],
        "video": [],
        "3d": [],
        "svg": []
    }
}