{
    "info.unet.stable-diffusion-xl": {
        "base": {
            "dep_alt": {
                "diffusers": [
                    "DiffusionPipeline"
                ]
            },
            "gen_kwargs": {
                "num_inference_steps": 40,
                "denoising_end": 0.8,
                "output_type": "latent",
                "safety_checker": false
            },
            "init_kwargs": {
                "use_safetensors": true
            },
            "layer_256": [
                "62a5ab1b5fdfa4fedb32323841298c6effe1af25be94a8583350b0a7641503ef"
            ],
            "repo": [
                "stabilityai/stable-diffusion-xl-base-1.0"
            ],
            "weight_map": "weight_maps/model.unet.stable-diffusion-xl:base.json"
        },
        "[init]": {
            "dep_pkg": {
                "diffusers": [
                    "StableDiffusionXLPipeline"
                ]
            }
        },
        "refiner": {
            "dep_alt": {
                "diffusers": [
                    "DiffusionPipeline"
                ]
            },
            "gen_kwargs": {
                "num_inference_steps": 40,
                "denoising_end": 0.8
            },
            "layer_256": [
                "8c2d0d32cff5a74786480bbaa932ee504bb140f97efdd1a3815f14a610cf6e4a"
            ],
            "repo": [
                "stabilityai/stable-diffusion-xl-refiner-1.0"
            ],
            "weight_map": "weight_maps/stable-diffusion-xl-refiner.json"
        },
        "pony-diffusion": {
            "dep_alt": {
                "diffusers": [
                    "DiffusionPipeline"
                ]
            },
            "layer_256": [
                "d4fc7682a4ea9f2dfa0133fafb068f03fdb479158a58260dcaa24dcf33608c16"
            ]
        },
        "animagine": {
            "layer_256": [
                "31164c11db41b007f15c94651a8b1fa4d24097c18782d20fabe13c59ee07aa3a"
            ]
        },
        "illustrious": {
            "layer_256": [
                "c4a8d365e7fe07c6dbdd52be922aa6dc23215142342e3e7f8f967f1a123a6982"
            ]
        },
        "turbo": {
            "layer_256": [
                "fc94481f0c52b21c5ac1fdade8d9c5b210f7239253f86ef21e6198fe393ed60e"
            ]
        },
        "playground-2.5-base": {
            "dep_alt": {
                "diffusers": [
                    "DiffusionPipeline"
                ]
            },
            "layer_256": [
                "a6f31493ceeb51c88c5239188b9078dc64ba66d3fc5958ad48c119115b06120c"
            ]
        },
        "playground-2.5-aesthetic": {
            "dep_alt": {
                "diffusers": [
                    "DiffusionPipeline"
                ]
            },
            "gen_kwargs": {
                "num_inference_steps": 50,
                "guidance_scale": 3
            },
            "init_kwargs": {
                "torch_dtype": "torch.float16",
                "variant": "fp16"
            },
            "layer_256": [
                "fe2e9edf7e3923a80e64c2552139d8bae926cc3b028ca4773573a6ba60e67c20",
                "d4813e9f984aa76cb4ac9bf0972d55442923292d276e97e95cb2f49a57227843"
            ],
            "repo": [
                "playgroundai/playground-v2.5-1024px-aesthetic"
            ]
        }
    },
    "info.unet.kolors": {
        "diffusers": {
            "gen_kwargs": {
                "negative_prompt": "",
                "guidance_scale": 5.0,
                "num_inference_steps": 50
            },
            "init_kwargs": {
                "torch_dtype": "torch.float16",
                "variant": "fp16"
            },
            "repo": [
                "kwai-kolors/kolors-diffusers"
            ]
        },
        "[init]": {
            "dep_pkg": {
                "diffusers": [
                    "KolorsPipeline"
                ]
            }
        }
    },
    "info.unet.stable-cascade": {
        "combined": {
            "gen_kwargs": {
                "negative_prompt": "",
                "num_inference_steps": 10,
                "prior_num_inference_steps": 20,
                "prior_guidance_scale": 3.0,
                "width": 1024,
                "height": 1024
            },
            "init_kwargs": {
                "variant": "bf16",
                "torch_dtype": "torch.bfloat16"
            },
            "repo": [
                "stabilityai/stable-cascade"
            ]
        },
        "[init]": {
            "dep_pkg": {
                "diffusers": [
                    "StableCascadeCombinedPipeline"
                ]
            }
        },
        "prior": {
            "dep_alt": {
                "diffusers": [
                    "StableCascadePriorPipeline"
                ]
            },
            "gen_kwargs": {
                "height": 1024,
                "width": 1024,
                "negative_prompt": "",
                "guidance_scale": 4.0,
                "num_images_per_prompt": 1,
                "num_inference_steps": 20
            },
            "init_kwargs": {
                "variant": "bf16",
                "torch_dtype": "torch.bfloat16"
            },
            "layer_256": [
                "2b6986954d9d2b0c702911504f78f5021843bd7050bb10444d70fa915cb495ea",
                "2aa5a461c4cd0e2079e81554081854a2fa01f9b876d7124c8fff9bf1308b9df7",
                "ce474fd5da12f1d465a9d236d61ea7e98458c1b9d58d35bb8412b2acb9594f08",
                "1b035ba92da6bec0a9542219d12376c0164f214f222955024c884e1ab08ec611",
                "22a49dc9d213d5caf712fbf755f30328bc2f4cbdc322bcef26dfcee82f02f147"
            ],
            "repo": [
                "stabilityai/stable-cascade-prior"
            ]
        },
        "decoder": {
            "gen_kwargs": {
                "guidance_scale": 0.0,
                "output_type": "pil",
                "num_inference_steps": 10
            },
            "init_kwargs": {
                "variant": "bf16",
                "torch_dtype": "torch.bfloat16"
            },
            "layer_256": [
                "fde5a91a908e8cb969f97bcd20e852fb028cc039a19633b0e1559ae41edeb16f",
                "24fa8b55d12bf904878b7f2cda47c04c1a92da702fe149e28341686c080dfd4f",
                "a7c96afb54e60386b7d077bf3f00d04596f4b877d58e6a577f0e1a08dc4a0190",
                "f1300b9ffe051640555bfeee245813e440076ef90b669332a7f9fb35fffb93e8",
                "047fa405c9cd5ad054d8f8c8baa2294fbc663e4121828b22cb190f7057842a64"
            ],
            "repo": [
                "stabilityai/stable-cascade"
            ]
        }
    },
    "info.dit.stable-diffusion-3": {
        "medium": {
            "gen_kwargs": {
                "num_inference_steps": 40,
                "guidance_scale": 4.5
            },
            "init_kwargs": {
                "torch_dtype": "torch.float16"
            },
            "layer_256": [
                "dee29a467c44cff413fcf1c2dda0b31f5f0a4e093029a8e5a05140f40ae061ee"
            ],
            "repo": [
                "stabilityai/stable-diffusion-3.5-medium",
                "adamo1139/stable-diffusion-3.5-medium-ungated"
            ]
        },
        "[init]": {
            "dep_pkg": {
                "diffusers": [
                    "StableDiffusion3Pipeline"
                ]
            }
        },
        "large": {
            "gen_kwargs": {
                "num_inference_steps": 28,
                "guidance_scale": 3.5
            },
            "init_kwargs": {
                "torch_dtype": "torch.float16"
            },
            "layer_256": [
                "8c2e5bc99bc89290254142469411db66cb2ca2b89b129cd2f6982b30e26bd465"
            ],
            "repo": [
                "stabilityai/stable-diffusion-3.5-large",
                "adamo1139/stable-diffusion-3.5-large-ungated"
            ]
        },
        "gguf": {
            "layer_256": [
                "e7eddc3cd09ccf7c9c03ceef70bbcd91d44d46673857d37c3abfe4e6ee240a96"
            ]
        },
        "alchemist-large": {
            "gen_kwargs": {
                "num_inference_steps": 28,
                "guidance_scale": 3.5
            },
            "init_kwargs": {
                "torch_dtype": "torch.bfloat16"
            },
            "repo": [
                "yandex/stable-diffusion-3.5-large-alchemist"
            ]
        },
        "alchemist-medium": {
            "gen_kwargs": {
                "num_inference_steps": 40,
                "guidance_scale": 4.5
            },
            "init_kwargs": {
                "torch_dtype": "torch.bfloat16"
            },
            "repo": [
                "yandex/stable-diffusion-3.5-medium-alchemist"
            ]
        }
    },
    "info.dit.flux-1": {
        "schnell": {
            "gen_kwargs": {
                "guidance_scale": 0.0,
                "num_inference_steps": 4,
                "max_sequence_length": 256
            },
            "init_kwargs": {
                "torch_dtype": "torch.bfloat16"
            },
            "layer_256": [
                "ef5c9cd1ebe6e3be5e8b1347eca0a6f0b138986c71220a7f1c2c14f29d01beed"
            ],
            "repo": [
                "black-forest-labs/flux.1-schnell",
                "cocktailpeanut/xulf-s"
            ]
        },
        "[init]": {
            "dep_pkg": {
                "diffusers": [
                    "FluxPipeline"
                ]
            }
        },
        "shuttle-3.1-aesthetic": {
            "dep_alt": {
                "diffusers": [
                    "DiffusionPipeline"
                ]
            },
            "gen_kwargs": {
                "height": 1024,
                "width": 1024,
                "guidance_scale": 3.5,
                "num_inference_steps": 4,
                "max_sequence_length": 256
            },
            "init_kwargs": {
                "torch_dtype": "torch.bfloat16"
            },
            "repo": [
                "shuttleai/shuttle-3.1-aesthetic"
            ]
        },
        "shuttle-3-diffusion": {
            "dep_alt": {
                "diffusers": [
                    "DiffusionPipeline"
                ]
            },
            "gen_kwargs": {
                "height": 1024,
                "width": 1024,
                "guidance_scale": 3.5,
                "num_inference_steps": 4,
                "max_sequence_length": 256
            },
            "init_kwargs": {
                "torch_dtype": "torch.bfloat16"
            },
            "repo": [
                "shuttleai/shuttle-3-diffusion"
            ]
        },
        "dev": {
            "gen_kwargs": {
                "height": 1024,
                "width": 1024,
                "guidance_scale": 3.5,
                "num_inference_steps": 50,
                "max_sequence_length": 512
            },
            "init_kwargs": {
                "torch_dtype": "torch.bfloat16"
            },
            "layer_256": [
                "ad8763121f98e28bc4a3d5a8b494c1e8f385f14abe92fc0ca5e4ab3191f3a881",
                "20d47474da0714979e543b6f21bd12be5b5f721119c4277f364a29e329e931b9"
            ],
            "repo": [
                "black-forest-labs/flux.1-dev",
                "cocktailpeanut/xulf-d"
            ]
        },
        "f-lite-8b": {
            "dep_alt": {
                "f_lite": [
                    "FLitePipeline"
                ]
            },
            "gen_kwargs": {
                "num_inference_steps": 28,
                "guidance_scale": 3.5,
                "height": 1024,
                "width": 1024
            },
            "init_kwargs": {
                "torch_dtype": "torch.bfloat16"
            },
            "repo": [
                "freepik/flux.1-lite-8b"
            ]
        },
        "f-lite-7b": {
            "dep_alt": {
                "f_lite": [
                    "FLitePipeline"
                ]
            },
            "gen_kwargs": {
                "num_inference_steps": 28,
                "guidance_scale": 3.5,
                "height": 1024,
                "width": 1024
            },
            "init_kwargs": {
                "torch_dtype": "torch.bfloat16"
            },
            "repo": [
                "freepik/f-lite-7b"
            ]
        },
        "lite-texture": {
            "dep_alt": {
                "f_lite": [
                    "FLitePipeline"
                ]
            },
            "gen_kwargs": {
                "num_inference_steps": 28,
                "guidance_scale": 3.5,
                "height": 1024,
                "width": 1024
            },
            "init_kwargs": {
                "torch_dtype": "torch.bfloat16"
            },
            "repo": [
                "freepik/f-lite-texture"
            ]
        },
        "hybrid": {
            "layer_256": [
                "14d0e1b573023deb5a4feaddf85ebca10ab2abf3452c433e2e3ae93acb216443",
                "14d0e1b573023deb5a4feaddf85ebca10ab2abf3452c433e2e3ae93acb216443"
            ]
        },
        "mini": {
            "dep_alt": {
                "diffusers": [
                    "diffusers"
                ]
            },
            "layer_256": [
                "e4a0d8cf2034da094518ab058da1d4aea14e00d132c6152a266ec196ffef02d0"
            ],
            "repo": [
                "TencentARC/flux-mini"
            ]
        }
    },
    "info.dit.auraflow": {
        "0": {
            "gen_kwargs": {
                "width": 1536,
                "height": 768,
                "num_inference_steps": 50,
                "guidance_scale": 3.5
            },
            "repo": [
                "fal/AuraFlow-v0.3",
                "fal/AuraFlow-v0.2",
                "fal/AuraFlow"
            ]
        },
        "[init]": {
            "dep_pkg": {
                "diffusers": [
                    "AuraFlowPipeline"
                ]
            }
        }
    },
    "info.dit.hunyuandit": {
        "diffusers": {
            "gen_kwargs": {
                "num_inference_steps": 50,
                "guidance_scale": 6
            },
            "repo": [
                "Tencent-Hunyuan/HunyuanDiT-v1.2-Diffusers"
            ]
        },
        "[init]": {
            "dep_pkg": {
                "diffusers": [
                    "HunyuanDiTPipeline"
                ]
            }
        },
        "distilled": {
            "gen_kwargs": {
                "num_inference_steps": 25
            },
            "repo": [
                "Tencent-Hunyuan/HunyuanDiT-v1.2-Diffusers-Distilled"
            ]
        }
    },
    "info.dit.pixart-sigma": {
        "xl-2-1024": {
            "init_kwargs": {
                "torch_dtype": "torch.float16",
                "use_safetensors": true
            },
            "repo": [
                "PixArt-alpha/PixArt-Sigma-XL-2-1024-MS"
            ]
        },
        "[init]": {
            "dep_pkg": {
                "diffusers": [
                    "PixArtSigmaPipeline"
                ]
            }
        }
    },
    "info.dit.cogview-3": {
        "plus-3b": {
            "gen_kwargs": {
                "height": 1024,
                "width": 1024,
                "guidance_scale": 4.0,
                "num_inference_steps": 50
            },
            "init_kwargs": {
                "torch_dtype": "torch.bfloat16"
            },
            "repo": [
                "THUDM/CogView3-Plus-3B"
            ]
        },
        "[init]": {
            "dep_pkg": {
                "diffusers": [
                    "CogView3PlusPipeline"
                ]
            }
        }
    },
    "info.dit.cogview-4": {
        "6b": {
            "gen_kwargs": {
                "height": 1024,
                "width": 1024,
                "guidance_scale": 3.5,
                "num_images_per_prompt": 1,
                "num_inference_steps": 50
            },
            "init_kwargs": {
                "torch_dtype": "torch.bfloat16"
            },
            "repo": [
                "THUDM/CogView4-6B"
            ]
        },
        "[init]": {
            "dep_pkg": {
                "diffusers": [
                    "CogView4Pipeline"
                ]
            }
        }
    },
    "info.dit.lumina-image": {
        "2.0": {
            "gen_kwargs": {
                "height": 1024,
                "width": 1024,
                "guidance_scale": 4.0,
                "num_inference_steps": 50,
                "cfg_trunc_ratio": 0.25,
                "cfg_normalization": true
            },
            "init_kwargs": {
                "torch_dtype": "torch.bfloat16"
            },
            "repo": [
                "alpha-vllm/lumina-image-2.0"
            ]
        },
        "[init]": {
            "dep_pkg": {
                "diffusers": [
                    "Lumina2Pipeline"
                ]
            }
        }
    },
    "info.dit.fuse-dit": {
        "2b": {
            "gen_kwargs": {
                "width": 512,
                "height": 512,
                "num_inference_steps": 25,
                "guidance_scale": 6.0,
                "use_cache": true
            },
            "repo": [
                "ooutlierr/fuse-dit"
            ]
        },
        "[init]": {
            "dep_pkg": {
                "diffusion": [
                    "pipelines.FuseDiTPipeline"
                ]
            }
        }
    },
    "info.art.phi-4": {
        "multimodal-instruct": {
            "init_kwargs": {
                "torch_dtype": "torch.bfloat16"
            },
            "repo": [
                "microsoft/Phi-4-multimodal-instruct"
            ]
        },
        "[init]": {
            "dep_pkg": {
                "transformers": [
                    "AutoModelForCausalLM"
                ]
            }
        }
    },
    "info.art.audiogen": {
        "medium-1.5b": {
            "repo": [
                "facebook/audiogen-medium"
            ]
        },
        "[init]": {
            "dep_pkg": {
                "audiocraft": [
                    "models",
                    "AudioGen"
                ]
            }
        }
    },
    "info.art.parler-tts": {
        "tiny-v1": {
            "init_kwargs": {
                "AutoTokenizer": {
                    "return_tensors": "pt"
                }
            },
            "repo": [
                "parler-tts/parler-tts-tiny-v1"
            ]
        },
        "[init]": {
            "dep_pkg": {
                "parler_tts": [
                    "ParlerTTSForConditionalGeneration"
                ],
                "transformers": [
                    "AutoTokenizer"
                ]
            }
        },
        "large-v1": {
            "init_kwargs": {
                "AutoTokenizer": {
                    "return_tensors": "pt"
                }
            },
            "repo": [
                "parler-tts/parler-tts-large-v1"
            ]
        }
    },
    "info.art.lumina-mgpt": {
        "7B-768": {
            "gen_kwargs": {
                "images": [],
                "qas": [
                    [
                        "q1",
                        null
                    ]
                ],
                "max_gen_len": 8192,
                "temperature": 1.0
            },
            "init_kwargs": {
                "precision": "bf16",
                "target_size": 768
            },
            "repo": [
                "Alpha-VLLM/Lumina-mGPT-7B-768"
            ]
        },
        "[init]": {
            "dep_pkg": {
                "inference_solver": [
                    "FlexARInferenceSolver"
                ]
            }
        }
    },
    "info.art.llama-3.1": {
        "8b-instruct": {
            "repo": [
                "meta-llama/llama-3.1-8b-instruct"
            ]
        },
        "[init]": {
            "dep_pkg": {
                "transformers": [
                    "AutoModel"
                ]
            }
        }
    },
    "info.art.orpheus": {
        "3b-0.1-ft": {
            "repo": [
                "canopylabs/orpheus-3b-0.1-ft"
            ]
        },
        "[init]": {
            "dep_pkg": {
                "orpheus_tts": [
                    "OrpheusModel"
                ]
            }
        }
    },
    "info.art.t5": {
        "large": {
            "repo": [
                "google-t5/t5-large"
            ]
        },
        "[init]": {
            "dep_pkg": {
                "transformers": [
                    "pipeline"
                ]
            }
        }
    },
    "info.art.outetts-0.3": {
        "1b": {
            "repo": [
                "outeai/outetts-0.3-1b"
            ]
        },
        "[init]": {
            "dep_pkg": {
                "outetts": [
                    "InterfaceHF"
                ]
            }
        }
    },
    "info.seq2seq.utravox": {
        "v0_5-llama-3_1-8b": {
            "repo": [
                "fixie-ai/ultravox-v0_5-llama-3_1-8b"
            ]
        },
        "[init]": {
            "dep_pkg": {
                "transformers": [
                    "pipeline"
                ]
            }
        }
    },
    "info.embedding.all-minilm": {
        "L6-v2": {
            "repo": [
                "sentence-transformers/all-minilm-l6-v2"
            ]
        },
        "[init]": {
            "dep_pkg": {
                "transformers": [
                    "pipeline"
                ]
            }
        }
    },
    "info.mix.bagel": {
        "7B-MoT": {
            "repo": [
                "ByteDance-Seed/BAGEL-7B-MoT"
            ]
        }
    },
    "info.lora.dmd": {
        "stable-diffusion-xl": {
            "gen_kwargs": {
                "num_inference_steps": 4,
                "guidance_scale": 0,
                "timesteps": [
                    999,
                    749,
                    499,
                    249
                ]
            },
            "repo": [
                "tianweiy/DMD2/"
            ]
        },
        "[init]": {
            "scheduler": "ops.scheduler.lcm",
            "scheduler_kwargs": {},
            "dep_pkg": {
                "diffusers": [
                    "diffusers"
                ]
            }
        }
    },
    "info.lora.dpo": {
        "stable-diffusion-xl": {
            "gen_kwargs": {
                "guidance_scale": 7.5,
                "num_inference_steps": 4
            },
            "repo": [
                "radames/sdxl-DPO-LoRA"
            ]
        },
        "[init]": {
            "scheduler": "ops.scheduler.dpm",
            "scheduler_kwargs": {
                "algorithm_type": "sde-dpmsolver++",
                "use_karras_sigmas": true,
                "order": 2
            },
            "dep_pkg": {
                "diffusers": [
                    "diffusers"
                ]
            }
        }
    },
    "info.lora.flash": {
        "stable-diffusion-xl": {
            "repo": [
                "jasperai/flash-sdxl"
            ]
        },
        "[init]": {
            "scheduler": "ops.scheduler.lcm",
            "scheduler_kwargs": {},
            "dep_pkg": {
                "diffusers": [
                    "diffusers"
                ]
            }
        },
        "pixart-alpha": {
            "repo": [
                "jasperai/flash-pixart"
            ]
        },
        "stable-diffusion-3": {
            "repo": [
                "jasperai/flash-sd3"
            ]
        },
        "stable-diffusion-1": {
            "gen_kwargs": {
                "num_inference_steps": 4,
                "guidance_scale": 0
            },
            "repo": [
                "jasperai/flash-sd"
            ]
        }
    },
    "info.lora.hyper": {
        "stable-diffusion-xl": {
            "init_kwargs": {
                "fuse": 1.0
            },
            "repo": [
                "ByteDance/Hyper-SD"
            ]
        },
        "[init]": {
            "dep_pkg": {
                "diffusers": [
                    "diffusers"
                ]
            }
        },
        "flux-1:dev": {
            "init_kwargs": {
                "fuse": 0.125
            },
            "repo": [
                "ByteDance/Hyper-SD"
            ]
        },
        "stable-diffusion-3": {
            "init_kwargs": {
                "fuse": 0.125
            },
            "repo": [
                "ByteDance/Hyper-SD"
            ]
        },
        "stable-diffusion-1": {
            "repo": [
                "ByteDance/Hyper-SD"
            ]
        }
    },
    "info.lora.lcm": {
        "stable-diffusion-xl": {
            "gen_kwargs": {
                "num_inference_steps": 8
            },
            "init_kwargs": {
                "fuse": 1.0
            },
            "repo": [
                "latent-consistency/lcm-lora-sdxl"
            ]
        },
        "[init]": {
            "scheduler": "ops.scheduler.lcm",
            "scheduler_kwargs": {
                "timestep_spacing": "trailing"
            },
            "dep_pkg": {
                "diffusers": [
                    "diffusers"
                ]
            }
        },
        "ssd-1b": {
            "gen_kwargs": {
                "num_inference_steps": 8
            },
            "repo": [
                "latent-consistency/lcm-lora-ssd-1b"
            ]
        },
        "vega": {
            "gen_kwargs": {
                "num_inference_steps": 8
            },
            "repo": [
                "segmind/Segmind-VegaRT"
            ]
        },
        "stable-diffusion-1": {
            "gen_kwargs": {
                "num_inference_steps": 8
            },
            "repo": [
                "latent-consistency/lcm-lora-sdv1-5"
            ]
        }
    },
    "info.lora.lightning": {
        "stable-diffusion-xl": {
            "gen_kwargs": {
                "num_inference_steps": 4,
                "guidance_scale": 0
            },
            "repo": [
                "ByteDance/SDXL-Lightning"
            ]
        },
        "[init]": {
            "dep_pkg": {
                "diffusers": [
                    "diffusers"
                ]
            }
        }
    },
    "info.lora.pcm": {
        "stable-diffusion-xl": {
            "repo": [
                "wangfuyun/PCM_Weights"
            ]
        },
        "stable-diffusion-1": {
            "repo": [
                "wangfuyun/PCM_Weights"
            ]
        }
    },
    "info.lora.slam": {
        "stable-diffusion-xl": {
            "gen_kwargs": {
                "num_inference_steps": 4,
                "guidance_scale": 1
            },
            "repo": [
                "alimama-creative/slam-lora-sdxl/"
            ]
        },
        "[init]": {
            "scheduler": "ops.scheduler.lcm",
            "scheduler_kwargs": {
                "timestep_spacing": "trailing"
            },
            "dep_pkg": {
                "diffusers": [
                    "diffusers"
                ]
            }
        },
        "stable-diffusion-1": {
            "repo": [
                "alimama-creative/slam-sd1.5"
            ]
        }
    },
    "info.lora.spo": {
        "stable-diffusion-xl": {
            "gen_kwargs": {
                "guidance_scale": 5.0
            },
            "repo": [
                "SPO-Diffusion-Models/SPO-SDXL_4k-p_10ep_LoRA"
            ]
        },
        "[init]": {
            "dep_pkg": {
                "diffusers": [
                    "diffusers"
                ]
            }
        },
        "stable-diffusion-1": {
            "gen_kwargs": {
                "guidance_scale": 7.5
            },
            "repo": [
                "SPO-Diffusion-Models/SPO-SD-v1-5_4k-p_10ep_LoRA"
            ]
        }
    },
    "info.lora.tcd": {
        "stable-diffusion-xl": {
            "gen_kwargs": {
                "num_inference_steps": 4,
                "guidance_scale": 0,
                "eta": 0.3
            },
            "repo": [
                "h1t/TCD-SDXL-LoRA"
            ]
        },
        "[init]": {
            "scheduler": "ops.scheduler.tcd",
            "scheduler_kwargs": {},
            "dep_pkg": {
                "diffusers": [
                    "diffusers"
                ]
            }
        },
        "stable-diffusion-1": {
            "repo": [
                "h1t/TCD-SD15-LoRA"
            ]
        }
    },
    "info.lora.turbo": {
        "flux-1:dev": {
            "gen_kwargs": {
                "guidance_scale": 3.5,
                "num_inference_steps": 8,
                "max_sequence_length": 512
            },
            "init_kwargs": {
                "fuse": 0.125
            },
            "repo": [
                "alimama-creative/FLUX.1-Turbo-Alpha"
            ]
        },
        "[init]": {
            "dep_pkg": {
                "diffusers": [
                    "diffusers"
                ]
            }
        }
    },
    "ops.scheduler.euler": {
        "[init]": {
            "dep_pkg": {
                "diffusers": [
                    "EulerDiscreteScheduler"
                ]
            }
        }
    },
    "ops.scheduler.euler-ancestral": {
        "[init]": {
            "dep_pkg": {
                "diffusers": [
                    "EulerAncestralDiscreteScheduler"
                ]
            }
        }
    },
    "ops.scheduler.flow-match": {
        "[init]": {
            "dep_pkg": {
                "diffusers": [
                    "FlowMatchEulerDiscreteScheduler"
                ]
            }
        }
    },
    "ops.scheduler.edm": {
        "[init]": {
            "dep_pkg": {
                "diffusers": [
                    "EDMDPMSolverMultistepScheduler"
                ]
            }
        }
    },
    "ops.scheduler.dpm": {
        "[init]": {
            "dep_pkg": {
                "diffusers": [
                    "DPMSolverMultistepScheduler"
                ]
            }
        }
    },
    "ops.scheduler.ddim": {
        "[init]": {
            "dep_pkg": {
                "diffusers": [
                    "DDIMScheduler"
                ]
            }
        }
    },
    "ops.scheduler.lcm": {
        "[init]": {
            "dep_pkg": {
                "diffusers": [
                    "LCMScheduler"
                ]
            }
        }
    },
    "ops.scheduler.tcd": {
        "[init]": {
            "dep_pkg": {
                "diffusers": [
                    "TCDScheduler"
                ]
            }
        }
    },
    "ops.scheduler.heun": {
        "[init]": {
            "dep_pkg": {
                "diffusers": [
                    "HeunDiscreteScheduler"
                ]
            }
        }
    },
    "ops.scheduler.uni-pc": {
        "[init]": {
            "dep_pkg": {
                "diffusers": [
                    "UniPCMultistepScheduler"
                ]
            }
        }
    },
    "ops.scheduler.lms": {
        "[init]": {
            "dep_pkg": {
                "diffusers": [
                    "LMSDiscreteScheduler"
                ]
            }
        }
    },
    "ops.scheduler.deis": {
        "[init]": {
            "dep_pkg": {
                "diffusers": [
                    "DEISMultistepScheduler"
                ]
            }
        }
    },
    "ops.scheduler.ddpm_wuerstchen": {
        "[init]": {
            "dep_pkg": {
                "diffusers": [
                    "DDPMWuerstchenScheduler"
                ]
            }
        }
    },
    "ops.scheduler.align-your-steps": {
        "stable-diffusion-xl": {}
    },
    "ops.float.bf16": {
        "pytorch": {},
        "[init]": {
            "dep_pkg": {
                "torch": [
                    "bfloat16"
                ]
            }
        }
    },
    "ops.float.f16": {
        "pytorch": {
            "variant": "fp16"
        },
        "[init]": {
            "dep_pkg": {
                "torch": [
                    "float16"
                ]
            }
        }
    },
    "ops.float.f32": {
        "pytorch": {
            "variant": "fp32"
        },
        "[init]": {
            "dep_pkg": {
                "torch": [
                    "float32"
                ]
            }
        }
    },
    "ops.float.f64": {
        "pytorch": {
            "variant": "fp64"
        },
        "[init]": {
            "dep_pkg": {
                "torch": [
                    "float64"
                ]
            }
        }
    },
    "ops.float.f8_e4m3": {
        "pytorch": {
            "variant": "fp8e4m3fn"
        },
        "[init]": {
            "dep_pkg": {
                "torch": [
                    "float8_e4m3fn"
                ]
            }
        }
    },
    "ops.float.f8_e5m2": {
        "pytorch": {
            "variant": "fp8e5m2"
        },
        "[init]": {
            "dep_pkg": {
                "torch": [
                    "float8_e5m2"
                ]
            }
        }
    },
    "ops.float.i16": {
        "pytorch": {},
        "[init]": {
            "dep_pkg": {
                "torch": [
                    "int16"
                ]
            }
        }
    },
    "ops.float.i32": {
        "pytorch": {},
        "[init]": {
            "dep_pkg": {
                "torch": [
                    "int32"
                ]
            }
        }
    },
    "ops.float.i64": {
        "pytorch": {},
        "[init]": {
            "dep_pkg": {
                "torch": [
                    "int64"
                ]
            }
        }
    },
    "ops.float.i8": {
        "pytorch": {},
        "[init]": {
            "dep_pkg": {
                "torch": [
                    "int8"
                ]
            }
        }
    },
    "ops.float.nf4": {
        "pytorch": {},
        "[init]": {
            "dep_pkg": {
                "torch": [
                    "nf4"
                ]
            }
        }
    },
    "ops.float.u8": {
        "pytorch": {},
        "[init]": {
            "dep_pkg": {
                "torch": [
                    "uint8"
                ]
            }
        }
    },
    "ops.patch.hidiffusion": {
        "stable-diffusion-xl": {
            "gen_kwargs": {
                "height": 2048,
                "width": 2048,
                "eta": 1.0,
                "guidance_scale": 7.5
            },
            "repo": [
                "github.com/megvii-research/HiDiffusion/"
            ]
        },
        "[init]": {
            "dep_pkg": {
                "hidiffusion": [
                    "apply_hidiffusion"
                ]
            }
        }
    }
}