{
    "info.unet.stable-diffusion-xl": {
        "base": {
            "gen_kwargs": {
                "num_inference_steps": 40,
                "denoising_end": 0.8,
                "output_type": "latent",
                "safety_checker": false
            },
            "init_kwargs": {
                "use_safetensors": true
            },
            "layer_256": [
                "62a5ab1b5fdfa4fedb32323841298c6effe1af25be94a8583350b0a7641503ef"
            ],
            "module_alt": [
                "DiffusionPipeline"
            ],
            "repo": "stabilityai/stable-diffusion-xl-base-1.0",
            "weight_map": "weight_maps/model.unet.stable-diffusion-xl:base.json"
        },
        "[init]": {
            "dep_pkg": [
                "diffusers",
                "transformers"
            ],
            "module_path": [
                "StableDiffusionXLPipeline"
            ]
        },
        "refiner": {
            "gen_kwargs": {
                "num_inference_steps": 40,
                "denoising_end": 0.8
            },
            "layer_256": [
                "8c2d0d32cff5a74786480bbaa932ee504bb140f97efdd1a3815f14a610cf6e4a"
            ],
            "module_alt": [
                "DiffusionPipeline"
            ],
            "repo": "stabilityai/stable-diffusion-xl-refiner-1.0",
            "weight_map": "weight_maps/stable-diffusion-xl-refiner.json"
        },
        "pony-diffusion": {
            "layer_256": [
                "d4fc7682a4ea9f2dfa0133fafb068f03fdb479158a58260dcaa24dcf33608c16"
            ],
            "module_alt": [
                "DiffusionPipeline"
            ]
        },
        "animagine": {
            "layer_256": [
                "31164c11db41b007f15c94651a8b1fa4d24097c18782d20fabe13c59ee07aa3a"
            ]
        },
        "illustrious": {
            "layer_256": [
                "c4a8d365e7fe07c6dbdd52be922aa6dc23215142342e3e7f8f967f1a123a6982"
            ]
        },
        "turbo": {
            "layer_256": [
                "fc94481f0c52b21c5ac1fdade8d9c5b210f7239253f86ef21e6198fe393ed60e"
            ]
        },
        "playground-2.5-base": {
            "layer_256": [
                "a6f31493ceeb51c88c5239188b9078dc64ba66d3fc5958ad48c119115b06120c"
            ],
            "module_alt": [
                "DiffusionPipeline"
            ]
        },
        "playground-2.5-aesthetic": {
            "gen_kwargs": {
                "num_inference_steps": 50,
                "guidance_scale": 3
            },
            "init_kwargs": {
                "torch_dtype": "torch.float16",
                "variant": "fp16"
            },
            "layer_256": [
                "fe2e9edf7e3923a80e64c2552139d8bae926cc3b028ca4773573a6ba60e67c20",
                "d4813e9f984aa76cb4ac9bf0972d55442923292d276e97e95cb2f49a57227843"
            ],
            "module_alt": [
                "DiffusionPipeline"
            ],
            "repo": "playgroundai/playground-v2.5-1024px-aesthetic"
        }
    },
    "info.unet.kolors": {
        "diffusers": {
            "gen_kwargs": {
                "negative_prompt": "",
                "guidance_scale": 5.0,
                "num_inference_steps": 50
            },
            "init_kwargs": {
                "torch_dtype": "torch.float16",
                "variant": "fp16"
            },
            "repo": "Kwai-Kolors/Kolors-diffusers"
        },
        "[init]": {
            "dep_pkg": [
                "diffusers",
                "transformers"
            ],
            "module_path": [
                "KolorsPipeline"
            ]
        }
    },
    "info.unet.stable-cascade": {
        "c": {
            "layer_256": [
                "2b6986954d9d2b0c702911504f78f5021843bd7050bb10444d70fa915cb495ea",
                "2aa5a461c4cd0e2079e81554081854a2fa01f9b876d7124c8fff9bf1308b9df7",
                "ce474fd5da12f1d465a9d236d61ea7e98458c1b9d58d35bb8412b2acb9594f08",
                "1b035ba92da6bec0a9542219d12376c0164f214f222955024c884e1ab08ec611",
                "22a49dc9d213d5caf712fbf755f30328bc2f4cbdc322bcef26dfcee82f02f147"
            ]
        },
        "[init]": {
            "dep_pkg": [
                "diffusers",
                "transformers"
            ]
        },
        "b": {
            "layer_256": [
                "fde5a91a908e8cb969f97bcd20e852fb028cc039a19633b0e1559ae41edeb16f",
                "24fa8b55d12bf904878b7f2cda47c04c1a92da702fe149e28341686c080dfd4f",
                "a7c96afb54e60386b7d077bf3f00d04596f4b877d58e6a577f0e1a08dc4a0190",
                "f1300b9ffe051640555bfeee245813e440076ef90b669332a7f9fb35fffb93e8",
                "047fa405c9cd5ad054d8f8c8baa2294fbc663e4121828b22cb190f7057842a64"
            ]
        }
    },
    "info.dit.stable-diffusion-3": {
        "medium": {
            "gen_kwargs": {
                "num_inference_steps": 40,
                "guidance_scale": 4.5
            },
            "init_kwargs": {
                "torch_dtype": "torch.float16"
            },
            "layer_256": [
                "dee29a467c44cff413fcf1c2dda0b31f5f0a4e093029a8e5a05140f40ae061ee"
            ],
            "repo_alt": [
                "adamo1139/stable-diffusion-3.5-medium-ungated"
            ],
            "repo": "stabilityai/stable-diffusion-3.5-medium"
        },
        "[init]": {
            "dep_pkg": [
                "diffusers",
                "transformers"
            ],
            "module_path": [
                "StableDiffusion3Pipeline"
            ]
        },
        "large": {
            "gen_kwargs": {
                "num_inference_steps": 28,
                "guidance_scale": 3.5
            },
            "init_kwargs": {
                "torch_dtype": "torch.float16"
            },
            "layer_256": [
                "8c2e5bc99bc89290254142469411db66cb2ca2b89b129cd2f6982b30e26bd465"
            ],
            "repo_alt": [
                "adamo1139/stable-diffusion-3.5-large-ungated"
            ],
            "repo": "stabilityai/stable-diffusion-3.5-large"
        },
        "gguf": {
            "layer_256": [
                "e7eddc3cd09ccf7c9c03ceef70bbcd91d44d46673857d37c3abfe4e6ee240a96"
            ]
        },
        "alchemist-large": {
            "gen_kwargs": {
                "num_inference_steps": 28,
                "guidance_scale": 3.5
            },
            "init_kwargs": {
                "torch_dtype": "torch.bfloat16"
            },
            "repo": "yandex/stable-diffusion-3.5-large-alchemist"
        },
        "alchemist-medium": {
            "gen_kwargs": {
                "num_inference_steps": 40,
                "guidance_scale": 4.5
            },
            "init_kwargs": {
                "torch_dtype": "torch.bfloat16"
            },
            "repo": "yandex/stable-diffusion-3.5-medium-alchemist"
        }
    },
    "info.dit.flux-1": {
        "schnell": {
            "gen_kwargs": {
                "guidance_scale": 0.0,
                "num_inference_steps": 4,
                "max_sequence_length": 256
            },
            "init_kwargs": {
                "torch_dtype": "torch.bfloat16"
            },
            "layer_256": [
                "ef5c9cd1ebe6e3be5e8b1347eca0a6f0b138986c71220a7f1c2c14f29d01beed"
            ],
            "repo_alt": [
                "cocktailpeanut/xulf-s"
            ],
            "repo": "black-forest-labs/flux.1-schnell"
        },
        "[init]": {
            "dep_pkg": [
                "diffusers",
                "transformers"
            ]
        },
        "shuttle-3.1-aesthetic": {
            "gen_kwargs": {
                "height": 1024,
                "width": 1024,
                "guidance_scale": 3.5,
                "num_inference_steps": 4,
                "max_sequence_length": 256
            },
            "init_kwargs": {
                "torch_dtype": "torch.bfloat16"
            },
            "module_alt": [
                "DiffusionPipeline"
            ],
            "repo": "shuttleai/shuttle-3.1-aesthetic"
        },
        "shuttle-3-diffusion": {
            "gen_kwargs": {
                "height": 1024,
                "width": 1024,
                "guidance_scale": 3.5,
                "num_inference_steps": 4,
                "max_sequence_length": 256
            },
            "init_kwargs": {
                "torch_dtype": "torch.bfloat16"
            },
            "module_alt": [
                "DiffusionPipeline"
            ],
            "repo": "shuttleai/shuttle-3-diffusion"
        },
        "dev": {
            "gen_kwargs": {
                "height": 1024,
                "width": 1024,
                "guidance_scale": 3.5,
                "num_inference_steps": 50,
                "max_sequence_length": 512
            },
            "init_kwargs": {
                "torch_dtype": "torch.bfloat16"
            },
            "layer_256": [
                "ad8763121f98e28bc4a3d5a8b494c1e8f385f14abe92fc0ca5e4ab3191f3a881",
                "20d47474da0714979e543b6f21bd12be5b5f721119c4277f364a29e329e931b9"
            ],
            "repo_alt": [
                "cocktailpeanut/xulf-d"
            ],
            "repo": "black-forest-labs/flux.1-dev"
        },
        "lite": {
            "gen_kwargs": {
                "num_inference_steps": 28,
                "guidance_scale": 3.5,
                "height": 1024,
                "width": 1024
            },
            "init_kwargs": {
                "torch_dtype": "torch.bfloat16"
            },
            "repo_alt": [
                "Freepik/F-Lite-Texture"
            ],
            "repo": "Freepik/flux.1-lite-8B"
        },
        "hybrid": {
            "layer_256": [
                "14d0e1b573023deb5a4feaddf85ebca10ab2abf3452c433e2e3ae93acb216443",
                "14d0e1b573023deb5a4feaddf85ebca10ab2abf3452c433e2e3ae93acb216443"
            ]
        },
        "mini": {
            "layer_256": [
                "e4a0d8cf2034da094518ab058da1d4aea14e00d132c6152a266ec196ffef02d0"
            ]
        }
    },
    "info.dit.auraflow": {
        "0": {
            "gen_kwargs": {
                "width": 1536,
                "height": 768,
                "num_inference_steps": 50,
                "guidance_scale": 3.5
            },
            "repo_alt": [
                "fal/AuraFlow-v0.2",
                "fal/AuraFlow"
            ],
            "repo": "fal/AuraFlow-v0.3"
        },
        "[init]": {
            "dep_pkg": [
                "diffusers",
                "transformers"
            ],
            "module_path": [
                "AuraFlowPipeline"
            ]
        }
    },
    "info.dit.hunyuandit": {
        "diffusers": {
            "gen_kwargs": {
                "num_inference_steps": 50,
                "guidance_scale": 6
            },
            "repo": "Tencent-Hunyuan/HunyuanDiT-v1.2-Diffusers"
        },
        "[init]": {
            "dep_pkg": [
                "diffusers",
                "transformers"
            ],
            "module_path": [
                "HunyuanDiTPipeline"
            ]
        },
        "distilled": {
            "gen_kwargs": {
                "num_inference_steps": 25
            },
            "repo": "Tencent-Hunyuan/HunyuanDiT-v1.2-Diffusers-Distilled"
        }
    },
    "info.dit.pixart-sigma": {
        "xl-2-1024": {
            "init_kwargs": {
                "torch_dtype": "torch.float16",
                "use_safetensors": true
            },
            "repo": "PixArt-alpha/PixArt-Sigma-XL-2-1024-MS"
        },
        "[init]": {
            "dep_pkg": [
                "diffusers",
                "transformers"
            ],
            "module_path": [
                "PixArtSigmaPipeline"
            ]
        }
    },
    "info.dit.cogview-3": {
        "plus-3b": {
            "gen_kwargs": {
                "height": 1024,
                "width": 1024,
                "guidance_scale": 4.0,
                "num_inference_steps": 50
            },
            "init_kwargs": {
                "torch_dtype": "torch.bfloat16"
            },
            "repo": "THUDM/CogView3-Plus-3B"
        },
        "[init]": {
            "dep_pkg": [
                "diffusers",
                "transformers"
            ],
            "module_path": [
                "CogView3PlusPipeline"
            ]
        }
    },
    "info.dit.cogview-4": {
        "6b": {
            "gen_kwargs": {
                "height": 1024,
                "width": 1024,
                "guidance_scale": 3.5,
                "num_images_per_prompt": 1,
                "num_inference_steps": 50
            },
            "init_kwargs": {
                "torch_dtype": "torch.bfloat16"
            },
            "repo": "THUDM/CogView4-6B"
        },
        "[init]": {
            "dep_pkg": [
                "diffusers",
                "transformers"
            ],
            "module_path": [
                "CogView4Pipeline"
            ]
        }
    },
    "info.dit.lumina-image": {
        "2.0": {
            "gen_kwargs": {
                "height": 1024,
                "width": 1024,
                "guidance_scale": 4.0,
                "num_inference_steps": 50,
                "cfg_trunc_ratio": 0.25,
                "cfg_normalization": true
            },
            "init_kwargs": {
                "torch_dtype": "torch.bfloat16"
            },
            "repo": "Alpha-VLLM/Lumina-Image-2.0"
        },
        "[init]": {
            "dep_pkg": [
                "diffusers",
                "transformers"
            ],
            "module_path": [
                "Lumina2Pipeline"
            ]
        }
    },
    "info.art.phi-4": {
        "multimodal-instruct": {
            "init_kwargs": {
                "torch_dtype": "torch.bfloat16"
            },
            "repo": "microsoft/Phi-4-multimodal-instruct"
        },
        "[init]": {
            "dep_pkg": [
                "transformers"
            ],
            "module_path": [
                "AutoModelForCausalLM"
            ]
        }
    },
    "info.art.lumina-mgpt": {
        "7B-768": {
            "gen_kwargs": {
                "images": [],
                "qas": [
                    [
                        "q1",
                        null
                    ]
                ],
                "max_gen_len": 8192,
                "temperature": 1.0
            },
            "init_kwargs": {
                "precision": "bf16",
                "target_size": 768
            },
            "repo": "Alpha-VLLM/Lumina-mGPT-7B-768"
        },
        "[init]": {
            "dep_pkg": [
                "github.com/Alpha-VLLM/Lumina-mGPT"
            ],
            "module_path": [
                "FlexARInferenceSolver"
            ]
        }
    },
    "info.lora.dmd": {
        "stable-diffusion-xl": {
            "gen_kwargs": {
                "num_inference_steps": 4,
                "guidance_scale": 0,
                "timesteps": [
                    999,
                    749,
                    499,
                    249
                ]
            },
            "repo": "tianweiy/DMD2/"
        },
        "[init]": {
            "scheduler": "ops.scheduler.lcm",
            "scheduler_kwargs": {},
            "dep_pkg": [
                "diffusers"
            ]
        }
    },
    "info.lora.dpo": {
        "stable-diffusion-xl": {
            "gen_kwargs": {
                "guidance_scale": 7.5,
                "num_inference_steps": 4
            },
            "repo": "radames/sdxl-DPO-LoRA"
        },
        "[init]": {
            "scheduler": "ops.scheduler.dpm",
            "scheduler_kwargs": {
                "algorithm_type": "sde-dpmsolver++",
                "use_karras_sigmas": true,
                "order": 2
            },
            "dep_pkg": [
                "diffusers"
            ]
        }
    },
    "info.lora.flash": {
        "stable-diffusion-xl": {
            "repo": "jasperai/flash-sdxl"
        },
        "[init]": {
            "scheduler": "ops.scheduler.lcm",
            "scheduler_kwargs": {},
            "dep_pkg": [
                "diffusers"
            ]
        },
        "pixart-alpha": {
            "repo": "jasperai/flash-pixart"
        },
        "stable-diffusion-3": {
            "repo": "jasperai/flash-sd3"
        },
        "stable-diffusion-1": {
            "gen_kwargs": {
                "num_inference_steps": 4,
                "guidance_scale": 0
            },
            "repo": "jasperai/flash-sd"
        }
    },
    "info.lora.hyper": {
        "stable-diffusion-xl": {
            "init_kwargs": {
                "fuse": 1.0
            },
            "repo": "ByteDance/Hyper-SD"
        },
        "[init]": {
            "dep_pkg": [
                "diffusers"
            ]
        },
        "flux-1:dev": {
            "init_kwargs": {
                "fuse": 0.125
            },
            "repo": "ByteDance/Hyper-SD"
        },
        "stable-diffusion-3": {
            "init_kwargs": {
                "fuse": 0.125
            },
            "repo": "ByteDance/Hyper-SD"
        },
        "stable-diffusion-1": {
            "repo": "ByteDance/Hyper-SD"
        }
    },
    "info.lora.lcm": {
        "stable-diffusion-xl": {
            "gen_kwargs": {
                "num_inference_steps": 8
            },
            "init_kwargs": {
                "fuse": 1.0
            },
            "repo": "latent-consistency/lcm-lora-sdxl"
        },
        "[init]": {
            "scheduler": "ops.scheduler.lcm",
            "scheduler_kwargs": {
                "timestep_spacing": "trailing"
            },
            "dep_pkg": [
                "diffusers"
            ]
        },
        "ssd-1b": {
            "gen_kwargs": {
                "num_inference_steps": 8
            },
            "repo": "latent-consistency/lcm-lora-ssd-1b"
        },
        "vega": {
            "gen_kwargs": {
                "num_inference_steps": 8
            },
            "repo": "segmind/Segmind-VegaRT"
        },
        "stable-diffusion-1": {
            "gen_kwargs": {
                "num_inference_steps": 8
            },
            "repo": "latent-consistency/lcm-lora-sdv1-5"
        }
    },
    "info.lora.lightning": {
        "stable-diffusion-xl": {
            "gen_kwargs": {
                "num_inference_steps": 4,
                "guidance_scale": 0
            },
            "repo": "ByteDance/SDXL-Lightning"
        },
        "[init]": {
            "dep_pkg": [
                "diffusers"
            ]
        }
    },
    "info.lora.pcm": {
        "stable-diffusion-xl": {
            "repo": "wangfuyun/PCM_Weights"
        },
        "stable-diffusion-1": {
            "repo": "wangfuyun/PCM_Weights"
        }
    },
    "info.lora.slam": {
        "stable-diffusion-xl": {
            "gen_kwargs": {
                "num_inference_steps": 4,
                "guidance_scale": 1
            },
            "repo": "alimama-creative/slam-lora-sdxl/"
        },
        "[init]": {
            "scheduler": "ops.scheduler.lcm",
            "scheduler_kwargs": {
                "timestep_spacing": "trailing"
            },
            "dep_pkg": [
                "diffusers"
            ]
        },
        "stable-diffusion-1": {
            "repo": "alimama-creative/slam-sd1.5"
        }
    },
    "info.lora.spo": {
        "stable-diffusion-xl": {
            "gen_kwargs": {
                "guidance_scale": 5.0
            },
            "repo": "SPO-Diffusion-Models/SPO-SDXL_4k-p_10ep_LoRA"
        },
        "[init]": {
            "dep_pkg": [
                "diffusers"
            ]
        },
        "stable-diffusion-1": {
            "gen_kwargs": {
                "guidance_scale": 7.5
            },
            "repo": "SPO-Diffusion-Models/SPO-SD-v1-5_4k-p_10ep_LoRA"
        }
    },
    "info.lora.tcd": {
        "stable-diffusion-xl": {
            "gen_kwargs": {
                "num_inference_steps": 4,
                "guidance_scale": 0,
                "eta": 0.3
            },
            "repo": "h1t/TCD-SDXL-LoRA"
        },
        "[init]": {
            "scheduler": "ops.scheduler.tcd",
            "scheduler_kwargs": {},
            "dep_pkg": [
                "diffusers"
            ]
        },
        "stable-diffusion-1": {
            "repo": "h1t/TCD-SD15-LoRA"
        }
    },
    "info.lora.turbo": {
        "flux-1:dev": {
            "gen_kwargs": {
                "guidance_scale": 3.5,
                "num_inference_steps": 8,
                "max_sequence_length": 512
            },
            "init_kwargs": {
                "fuse": 0.125
            },
            "repo": "alimama-creative/FLUX.1-Turbo-Alpha"
        },
        "[init]": {
            "dep_pkg": [
                "diffusers"
            ]
        }
    },
    "ops.scheduler.euler": {
        "any": {},
        "[init]": {
            "dep_pkg": [
                "diffusers"
            ],
            "module_path": [
                "EulerDiscreteScheduler"
            ]
        }
    },
    "ops.scheduler.euler-ancestral": {
        "any": {},
        "[init]": {
            "dep_pkg": [
                "diffusers"
            ],
            "module_path": [
                "EulerAncestralDiscreteScheduler"
            ]
        }
    },
    "ops.scheduler.flow-match": {
        "any": {},
        "[init]": {
            "dep_pkg": [
                "diffusers"
            ],
            "module_path": [
                "FlowMatchEulerDiscreteScheduler"
            ]
        }
    },
    "ops.scheduler.edm": {
        "any": {},
        "[init]": {
            "dep_pkg": [
                "diffusers"
            ],
            "module_path": [
                "EDMDPMSolverMultistepScheduler"
            ]
        }
    },
    "ops.scheduler.dpm": {
        "any": {},
        "[init]": {
            "dep_pkg": [
                "diffusers"
            ],
            "module_path": [
                "DPMSolverMultistepScheduler"
            ]
        }
    },
    "ops.scheduler.ddim": {
        "any": {},
        "[init]": {
            "dep_pkg": [
                "diffusers"
            ],
            "module_path": [
                "DDIMScheduler"
            ]
        }
    },
    "ops.scheduler.lcm": {
        "any": {},
        "[init]": {
            "dep_pkg": [
                "diffusers"
            ],
            "module_path": [
                "LCMScheduler"
            ]
        }
    },
    "ops.scheduler.tcd": {
        "any": {},
        "[init]": {
            "dep_pkg": [
                "diffusers"
            ],
            "module_path": [
                "TCDScheduler"
            ]
        }
    },
    "ops.scheduler.heun": {
        "any": {},
        "[init]": {
            "dep_pkg": [
                "diffusers"
            ],
            "module_path": [
                "HeunDiscreteScheduler"
            ]
        }
    },
    "ops.scheduler.uni-pc": {
        "any": {},
        "[init]": {
            "dep_pkg": [
                "diffusers"
            ],
            "module_path": [
                "UniPCMultistepScheduler"
            ]
        }
    },
    "ops.scheduler.lms": {
        "any": {},
        "[init]": {
            "dep_pkg": [
                "diffusers"
            ],
            "module_path": [
                "LMSDiscreteScheduler"
            ]
        }
    },
    "ops.scheduler.deis": {
        "any": {},
        "[init]": {
            "dep_pkg": [
                "diffusers"
            ],
            "module_path": [
                "DEISMultistepScheduler"
            ]
        }
    },
    "ops.scheduler.ddpm_wuerstchen": {
        "any": {},
        "[init]": {
            "dep_pkg": [
                "diffusers"
            ],
            "module_path": [
                "DDPMWuerstchenScheduler"
            ]
        }
    },
    "ops.scheduler.align-your-steps": {
        "stable-diffusion-xl": {},
        "[init]": {
            "dep_pkg": [
                "diffusers"
            ],
            "module_path": [
                "schedulers.scheduling_utils",
                "AysSchedules"
            ]
        }
    },
    "ops.float.pytorch": {
        "BF16": {
            "dtype": "torch.bfloat16"
        },
        "F16": {
            "dtype": "torch.float16",
            "variant": "fp16"
        },
        "F32": {
            "dtype": "torch.float32",
            "variant": "fp32"
        },
        "F64": {
            "dtype": "torch.float64",
            "variant": "fp64"
        },
        "[init]": {
            "dep_pkg": [
                "torch"
            ]
        },
        "F8_E4M3": {
            "dtype": "torch.float8_e4m3fn",
            "variant": "fp8e4m3fn"
        },
        "F8_E5M2": {
            "dtype": "torch.float8_e5m2",
            "variant": "fp8e5m2"
        },
        "I16": {
            "dtype": "torch.int16"
        },
        "I32": {
            "dtype": "torch.int32"
        },
        "I64": {
            "dtype": "torch.int64"
        },
        "I8": {
            "dtype": "torch.int8"
        },
        "NF4": {
            "dtype": "nf4"
        },
        "U8": {
            "dtype": "torch.uint8"
        }
    },
    "ops.patch.hidiffusion": {
        "stable-diffusion-xl": {
            "gen_kwargs": {
                "height": 2048,
                "width": 2048,
                "eta": 1.0,
                "guidance_scale": 7.5
            },
            "repo": "megvii-research/HiDiffusion/"
        },
        "[init]": {
            "dep_pkg": [
                "hidiffusion"
            ],
            "module_path": [
                "apply_hidiffusion"
            ]
        }
    }
}